<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Digital;
class DigitalSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Digital::truncate(); // Deletes all rows and resets the auto-increment ID
        $digitals = [
            ['title' => 'ჯანდაცვა', 'text' => 'ჯანდაცვის სისტემა კიდევ უფრო დახვეწილი და ეფექტური გახდება, რადგან გაციფრულების საშუალებით გაძლიერდება როგორც სამედიცინო მომსახურების ხარისხი, ასევე პაციენტების კმაყოფილება. ტექნოლოგიების, როგორიცაა ხელოვნური ინტელექტი, დიდი მონაცემთა ანალიზი და გენომური მედიცინა, გამოყენება ხელს შეუწყობს დაავადებების ადრეულ გამოვლენას, პირადულ მკურნალობას და პრევენციის ოპტიმიზაციას. პაციენტები შეძლებენ მონიტორინგის განხორციელებას და კონსულტაციებს მიიღებენ დისტანციურად, რაც მნიშვნელოვნად გააუმჯობესებს მათ გამოცდილებას და აადვილებს ჯანდაცვის სერვისებზე წვდომას. ასევე, სამედიცინო პერსონალი მეტად შეძლებს ტექნოლოგიების გამოყენებას და შეცდომების შემცირებას, რაც შექმნის სწრაფ და უსაფრთხო რეაგირების სისტემებს. ჯანდაცვის სისტემა მთლიანად იქნება ინტეგრირებული, სადაც მონაცემთა გაცვლა მოხდება სწრაფად, უსაფრთხოდ და მარტივად, რაც გააუმჯობესებს როგორც პროცედურებს, ისე პაციენტების ცხოვრებას.'],
            ['title' => 'ელექტრონული მმართველობა', 'text' => 'ელექტრონული მმართველობა (e-Government) წარმოადგენს სახელმწიფოსა და მოქალაქეებისთვის სახელმწიფო სერვისების გაციფრულებას, რაც საშუალებას იძლევა, რომ ადმინისტრაციული პროცესები მოხდეს ონლაინ რეჟიმში, სწრაფად და ეფექტურად. ეს ინიციატივა გულისხმობს დოკუმენტების ელექტრონულ შემუშავებას, საჯარო სამსახურის ონლაინ ხელმისაწვდომობას, მოქალაქეთა და ბიზნესის ურთიერთობების გამარტივებას, ასევე გადაწყვეტილებების მიღების პროცესის გამჭვირვალობას. ელექტრონული მმართველობა აუმჯობესებს საჯარო სექტორის მომსახურების ხარისხს, ზრდის საზოგადოების ჩართულობას და ხელს უწყობს თანამედროვე ტექნოლოგიების გამოყენებას ქვეყნის განვითარებისათვის.'],
            ['title' => 'კიბერუსაფრთხოება', 'text' => 'კიბერუსაფრთხოება გულისხმობს ინტერნეტსა და ციფრულ სისტემებში მონაცემების, სისტემების და ქსელების დაცვას არასანქცირებული წვდომის, დანაშაულებრივი აქტივობების, მონაცემთა დაკარგვის ან ზიანისგან. ეს მოიცავს სერვერების, კომპიუტერების, ქსელების და პროგრამული უზრუნველყოფის დაცვას ვირუსების, ჰაკერული თავდასხმების, პერსონალური მონაცემების გაჟონვის და სხვა კიბერდანაშაულებისგან. კიბერუსაფრთხოება მნიშვნელოვანია როგორც კერძო, ისე საჯარო სექტორებში, რადგან იცავს ორგანიზაციების და მოქალაქეების პირად ინფორმაციას, უზრუნველყოფს ბიზნესების უწყვეტ მუშაობას და სახელმწიფო სტრუქტურების სანდოობას. ასევე, იგი ხელს უწყობს ციფრული ტრანსფორმაციის პროცესის უსაფრთხო განხორციელებას.'],
            ['title' => 'განათლება და კვლევა', 'text' => 'განათლების გაციფრულება გულისხმობს თანამედროვე ტექნოლოგიების, ციფრული პლატფორმებისა და რესურსების გამოყენებას საგანმანათლებლო პროცესებში, რაც გაამარტივებს და გააუმჯობესებს განათლების ხელმისაწვდომობას და ხარისხს. ეს პროცესი მოიცავს ონლაინ სწავლებას, ციფრულ რესურსებს (მათ შორის ელექტრონული წიგნები, ვიდეო გაკვეთილები, ინტერნეტ-კურსები) და სამეცნიერო კვლევების ციფრულ არქივებს. განათლების გაციფრულება გვეხმარება სტუდენტებსა და პედაგოგებს მარტივად გაუზიარონ მასალები, ითანამშრომლონ დისტანციურად და განვითარდეს ახალი საგანმანათლებლო მეთოდები, რომლებიც საშუალებას აძლევს სწავლების პროცესს იყოს უფრო მოქნილი და პერსონალიზირებული. ციფრული განათლება ასევე უზრუნველყოფს განათლების სისტემის უკეთეს მართვას, რესურსების ოპტიმიზაციას და სტუდენტების პროგრესის რეალურ დროში მონიტორინგს.'],
            ['title' => 'ინდუსტრიის დიჯითალიზაცია', 'text' => 'ინდუსტრიის დიგიტალიზაცია გულისხმობს თანამედროვე ციფრული ტექნოლოგიების დანერგვას და ინტეგრაციას წარმოების, ბიზნესის პროცესებისა და საოფისე საქმიანობების გაუმჯობესების მიზნით. ეს მოიცავს ავტომატიზაციას, მონაცემთა ანალიზს, IoT (ინტერნეტიდან სმარტ მოწყობილობების დაკავშირებას), ხელოვნური ინტელექტის (AI) და ციფრული პლატფორმების გამოყენებას, რომლებიც ხელს უწყობენ წარმოების ეფექტურობას, პროცესების ოპტიმიზაციას, პროდუქტისა და მომსახურების ხარისხის გაუმჯობესებას. ინდუსტრიის დიგიტალიზაცია ზრდის კონკურენტუნარიანობას, მცირდება ხარჯები, ხოლო მუშაობის ხარისხი და სისწრაფე მნიშვნელოვნად იზრდება. ციფრული ტექნოლოგიები ასევე მხარს უჭერენ უკეთეს მონაცემთა ანალიზს, რაც აწვდის საწარმოს მნიშვნელოვნად მნიშვნელოვან ინფორმაციას სწრაფი და გონივრული გადაწყვეტილებების მიღებისთვის.'],
      
        ];

        foreach ($digitals as $digital) {
            Digital::create([
                'title' => $digital['title'],
                'text' => $digital['text']
            ]);
        }
    }
}
